<h2>Exercise</h2>
<br>
Using a pandas dataframe use the dictionary below and transform the states as the <br>
index.<br>
<code>
data = { 'New York':20, 
    'California':10, 
    'Rhode Island':5, 
    'Texas': 15, 
    'Florida':8, 
    'New Hampshire':3, 
    'New Jersey':12}
</code>

In [ ]:
import pandas as pd
data = { 'New York':20, 
    'California':10, 
    'Rhode Island':5, 
    'Texas': 15, 
    'Florida':8, 
    'New Hampshire':3, 
    'New Jersey':12}
state_info = pd.DataFrame(data.values(),index = data.keys())
state_info

                0
New York       20
California     10
Rhode Island    5
Texas          15
Florida         8
New Hampshire   3
New Jersey     12

<h2>Exercise</h2>
Print out the results of California to Florida<br>
<code>
import pandas as pd
data = { 'New York':20, 
    'California':10, 
    'Rhode Island':5, 
    'Texas': 15, 
    'Florida':8, 
    'New Hampshire':3, 
    'New Jersey':12}
state_info = pd.DataFrame(data.values(),index = data.keys())
</code>

In [ ]:
import pandas as pd
data = { 'New York':20, 
    'California':10, 
    'Rhode Island':5, 
    'Texas': 15, 
    'California':17, 
    'Florida':8, 
    'New Hampshire':3, 
    'New Jersey':12}
state_info = pd.DataFrame(data.values(),index = data.keys())
state_info.loc['California':'Florida']

               0
California    17
Rhode Island   5
Texas         15
Florida        8

<h2>Pandas - Add column headers</h2>
To add a column header use the columns parameter.
<br>
<code>
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info
</code>

In [ ]:
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info

               Yes  No
New York        20  15
California      10   3
Rhode Island     5   6
Texas           15   3
Florida          8   9
New Hampshire    3   4
New Jersey      12   8

<h2>Exercise</h2>
Create a new column called 'Total Votes'

In [ ]:
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'California':[17,4], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info['Total votes'] = state_info['Yes'] + state_info['No']
state_info

               Yes  No  Total votes
New York        20  15           35
California      17   4           21
Rhode Island     5   6           11
Texas           15   3           18
Florida          8   9           17
New Hampshire    3   4            7
New Jersey      12   8           20

<h2>Pandas - Remove a column</h2>
There are 2 ways to remove a column from a dataframe.<br>
<br>
Method 1<br
To drop a column use the drop method with the axis parameter
<br>
<code>
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'California':[17,4], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info['Total votes'] = state_info['Yes'] + state_info['No']
df = state_info.drop('Total votes', axis='columns')
df
</code>
NOTE: The drop is not executed in place.  You need to rename the dataframe to see<br>
    your changes

In [ ]:
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'California':[17,4], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info['Total votes'] = state_info['Yes'] + state_info['No']
state_info.drop('Total votes', axis='columns', inplace = True)
state_info
# if you don't use inplace=True do below
# df = state_info.drop('Total votes', axis='columns')
# df

               Yes  No
New York        20  15
California      17   4
Rhode Island     5   6
Texas           15   3
Florida          8   9
New Hampshire    3   4
New Jersey      12   8

<h2>Pandas - Remove a column - Method 2</h2>
Use the pop method to remove the column in place<br>
<code>
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'California':[17,4], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info['Total votes'] = state_info['Yes'] + state_info['No']
state_info.pop('Total votes')
state_info
</code>

In [ ]:
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
state_info['Total votes'] = state_info['Yes'] + state_info['No']
state_info
state_info.pop('Total votes')
state_info

               Yes  No
New York        20  15
California      10   3
Rhode Island     5   6
Texas           15   3
Florida          8   9
New Hampshire    3   4
New Jersey      12   8

<h2>Exercise</h2>
Take the columns yes and no and transform them from values to a percentage of the votes for each State<br>
And make the data type a float32
<code>
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No'])
<code>

In [ ]:
import pandas as pd
data = { 'New York':[20,15], 
    'California':[10,3], 
    'Rhode Island':[5,6], 
    'Texas': [15,3], 
    'California':[17,4], 
    'Florida':[8,9], 
    'New Hampshire':[3,4], 
    'New Jersey':[12,8]}
state_info = pd.DataFrame(data.values(),index = data.keys(),columns=['Yes','No']).astype('float32')
state_info['Total votes'] = state_info['Yes'] + state_info['No']
state_info['% Yes'] = ((state_info['Yes']/(state_info['Yes'] + state_info['No']))*100).astype('float64').round(2)
state_info['% No'] = ((state_info['No']/(state_info['Yes'] + state_info['No']))*100).astype('float64').round(2)
# state_info.pop('Total votes')
# state_info.pop('Yes')
# state_info.pop('No')
state_info

                Yes    No  Total votes  % Yes   % No
New York       20.0  15.0         35.0  57.14  42.86
California     17.0   4.0         21.0  80.95  19.05
Rhode Island    5.0   6.0         11.0  45.45  54.55
Texas          15.0   3.0         18.0  83.33  16.67
Florida         8.0   9.0         17.0  47.06  52.94
New Hampshire   3.0   4.0          7.0  42.86  57.14
New Jersey     12.0   8.0         20.0  60.00  40.00

<h2>Creata a dataframe using a list of lists</h2>

In [ ]:
import numpy as nd
import pandas as pd
idx = ['row_1','row_2','row_3']
df = pd.DataFrame([[1,0,0],[0, 1, 0],[0,0,1]],index=idx,columns=['col 1','col 2','col 3'])
df

       col 1  col 2  col 3
row_1      1      0      0
row_2      0      1      0
row_3      0      0      1

In [ ]:
import pandas as pd
df = pd.read_excel(r'AMD_EXCEL.xlsx')
df

,Date,Open,High,Low,Close,Adj_Close,Volume
0,2019-01-22,20.480000,20.920000,19.700001,19.760000,19.760000,78513700
1,2019-01-23,20.030001,20.480000,19.549999,19.799999,19.799999,77811300
2,2019-01-24,20.059999,21.010000,20.040001,20.850000,20.850000,97433400
3,2019-01-25,20.990000,22.030001,20.790001,21.930000,21.930000,110239500
4,2019-01-28,20.320000,21.010000,20.020000,20.180000,20.180000,135164100
...,...,...,...,...,...,...,...
498,2021-01-12,97.860001,98.970001,94.070000,95.360001,95.360001,67672300
499,2021-01-13,93.010002,93.889999,90.839996,91.779999,91.779999,60712900
500,2021-01-14,91.769997,92.360001,90.449997,90.790001,90.790001,53408200
501,2021-01-15,90.750000,91.589996,87.860001,88.209999,88.209999,49340300
502,2021-01-19,89.559998,89.580002,87.239998,89.449997,89.449997,44982400

In [ ]:
# C:\Projects\Pandas
import pandas as pd
df = pd.read_excel(r'AMD_EXCEL_multisheets.xls',sheet_name='ROR')
df

In [ ]:
df = pd.read_csv(r'US_Cities_delimited.txt',delimiter='|')
df.head()  # The default is the first 5

,Order,State_City,Population,Budget,Mayor,Begin_Term,End_Term,Govern_Type,foo1,foo2
0,1,"New York, New York","8,405,837","$73,000,000,000",Bill de Blasio (D),2014,2022,Strong mayor,Yes,No
1,2,"Los Angeles, California","3,884,307","$8,100,000,000",Eric Garcetti (D),2013,2022,Strong mayor,Yes,No
2,3,"Chicago, Illinois","2,718,782","$7,300,000,000",Lori Lightfoot (D),2019,2023,Strong mayor,No,No
3,4,"Houston, Texas","2,195,914","$5,100,000,000",Sylvester Turner (D),2016,2024,Strong mayor,No,No
4,5,"Philadelphia, Pennsylvania","1,553,165","$3,950,000,000",James Kenney (D),2016,2024,Strong mayor,No,No

In [ ]:
df = pd.read_csv(r'US_Cities_delimited.txt',delimiter='|')
df['Population'].tail(10)
df.dtypes

Order           int64
State_City     object
Population     object
Budget         object
Mayor          object
Begin_Term      int64
End_Term        int64
Govern_Type    object
foo1           object
foo2           object
dtype: object

In [ ]:
df[50:75]

,Order,State_City,Population,Budget,Mayor,Begin_Term,End_Term,Govern_Type,foo1,foo2
50,51,"New Orleans, Louisiana","378,715","$505,000,000",LaToya Cantrell (D),2018,2022,Strong mayor,Yes,No
51,52,"Bakersfield, California","363,630","$418,000,000",Karen Goh (R),2017,2025,Council-manager,Yes,Yes
52,53,"Tampa, Florida","352,957","$830,000,000",Jane Castor (D),2019,2023,Strong mayor,No,No
53,54,"Aurora, Colorado","345,803","$591,400,000",Mike Coffman (R),2019,2023,Council-manager,No,No
54,55,"Anaheim, California","345,012","$1,600,000,000",Harry Sidhu (R),2018,2022,Council-manager,Yes,No
55,56,"Santa Ana, California","334,227","$430,000,000",Miguel Pulido (D),1994,2020,Council-manager,Yes,Yes
56,57,"St. Louis, Missouri","318,416","$985,200,000",Lyda Krewson (D),2017,2021,Strong mayor,Yes,No
57,58,"Riverside, California","316,619","$894,000,000",Patricia Lock Dawson (NP),2012,2024,Council-manager,No,Yes
58,59,"Corpus Christi, Texas","316,381","$772,000,000",Joe McComb (R),2017,2020,Council-manager,Yes,Yes
59,60,"Lexington, Kentucky","308,428","$540,000,000",Linda Gorton (R),2019,2023,Strong mayor,Yes,No
60,61,"Pittsburgh, Pennsylvania","305,841","$488,000,000",Bill Peduto (D),2014,2022,Strong mayor,No,No
61,62,"Anchorage, Alaska","300,950","$471,000,000",Austin Quinn-Davidson (NP),2020,2021,Hybrid,Yes,No
62,63,"Stockton, California","298,118","$632,000,000",Kevin Lincoln II (R),2021,2024,Council-manager,Yes,Yes
63,64,"Cincinnati, Ohio","297,517","$358,000,000",John Cranley (D),2013,2022,Hybrid,No,No
64,65,"St. Paul, Minnesota","294,873","$515,500,000",Melvin Carter III (D),2018,2022,Strong mayor,No,No
65,66,"Toledo, Ohio","282,313","$650,000,000",Wade Kapszukiewicz (D),2018,2022,Strong mayor,Yes,No
66,67,"Greensboro, North Carolina","279,639","$472,000,000",Nancy B. Vaughan (D),2013,2021,Council-manager,No,No
67,68,"Newark, New Jersey","278,427","$800,000,000",Ras J. Baraka (D),2014,2022,Strong mayor,No,No
68,69,"Plano, Texas","274,409","$492,000,000",Harry LaRosiliere (R),2013,2021,Council-manager,No,No
69,70,"Henderson, Nevada","270,811","$482,000,000",Debra March (D),2017,2021,Council-manager,No,No
70,71,"Lincoln, Nebraska","268,738","$159,000,000",Leirion Gaylor Baird (D),2019,2023,Strong mayor,No,No
71,72,"Buffalo, New York","258,959","$479,900,000",Byron Brown (D),2005,2021,Strong mayor,No,No
72,73,"Jersey City, New Jersey","257,342","$535,300,000",Steven Fulop (D),2013,2021,Strong mayor,Yes,No
73,74,"Chula Vista, California","256,780","$293,400,000",Mary Salas (D),2014,2022,Council-manager,Yes,No
74,75,"Fort Wayne, Indiana","256,496","$190,200,000",Tom Henry (D),2008,2024,Strong mayor,No,No

In [ ]:
df.loc[60:75]

,Order,State_City,Population,Budget,Mayor,Begin_Term,End_Term,Govern_Type,foo1,foo2
60,61,"Pittsburgh, Pennsylvania","305,841","$488,000,000",Bill Peduto (D),2014,2022,Strong mayor,No,No
61,62,"Anchorage, Alaska","300,950","$471,000,000",Austin Quinn-Davidson (NP),2020,2021,Hybrid,Yes,No
62,63,"Stockton, California","298,118","$632,000,000",Kevin Lincoln II (R),2021,2024,Council-manager,Yes,Yes
63,64,"Cincinnati, Ohio","297,517","$358,000,000",John Cranley (D),2013,2022,Hybrid,No,No
64,65,"St. Paul, Minnesota","294,873","$515,500,000",Melvin Carter III (D),2018,2022,Strong mayor,No,No
65,66,"Toledo, Ohio","282,313","$650,000,000",Wade Kapszukiewicz (D),2018,2022,Strong mayor,Yes,No
66,67,"Greensboro, North Carolina","279,639","$472,000,000",Nancy B. Vaughan (D),2013,2021,Council-manager,No,No
67,68,"Newark, New Jersey","278,427","$800,000,000",Ras J. Baraka (D),2014,2022,Strong mayor,No,No
68,69,"Plano, Texas","274,409","$492,000,000",Harry LaRosiliere (R),2013,2021,Council-manager,No,No
69,70,"Henderson, Nevada","270,811","$482,000,000",Debra March (D),2017,2021,Council-manager,No,No
70,71,"Lincoln, Nebraska","268,738","$159,000,000",Leirion Gaylor Baird (D),2019,2023,Strong mayor,No,No
71,72,"Buffalo, New York","258,959","$479,900,000",Byron Brown (D),2005,2021,Strong mayor,No,No
72,73,"Jersey City, New Jersey","257,342","$535,300,000",Steven Fulop (D),2013,2021,Strong mayor,Yes,No
73,74,"Chula Vista, California","256,780","$293,400,000",Mary Salas (D),2014,2022,Council-manager,Yes,No
74,75,"Fort Wayne, Indiana","256,496","$190,200,000",Tom Henry (D),2008,2024,Strong mayor,No,No
75,76,"Orlando, Florida","255,483","$934,000,000",Buddy Dyer (D),2003,2024,Strong mayor,No,No

In [ ]:
df[df.Begin_Term == 2016 ]

,Order,State_City,Population,Budget,Mayor,Begin_Term,End_Term,Govern_Type,foo1,foo2
3,4,"Houston, Texas","2,195,914","$5,100,000,000",Sylvester Turner (D),2016,2024,Strong mayor,No,No
4,5,"Philadelphia, Pennsylvania","1,553,165","$3,950,000,000",James Kenney (D),2016,2024,Strong mayor,No,No
12,13,"Indianapolis, Indiana","843,393","$1,030,000,000",Joseph Hogsett (D),2016,2024,Strong mayor,No,No
20,21,"Memphis, Tennessee","653,450","$618,000,000",Jim Strickland (D),2016,2024,Strong mayor,No,No
34,35,"Sacramento, California","479,686","$819,000,000",Darrell Steinberg (D),2016,2024,Council-manager,Yes,Yes
46,47,"Tulsa, Oklahoma","398,121","$597,000,000",G. T. Bynum (R),2016,2024,Strong mayor,No,Yes
79,80,"Norfolk, Virginia","246,139","$1,100,000,000",Kenneth Alexander (D),2016,2024,Council-manager,Yes,Yes
82,83,"Lubbock, Texas","239,538","$674,500,000",Dan Pope (R),2016,2020,Council-manager,Yes,Yes
95,96,"Fremont, California","224,922","$238,460,000",Lily Mei (Nonpartisan),2016,2020,Council-manager,Yes,Yes
99,100,"Richmond, Virginia","207,878","$1,722,417,160",Levar Stoney (D),2016,2020,Strong mayor,Yes,Yes

In [ ]:
df.count()

Order          100
State_City     100
Population     100
Budget         100
Mayor          100
Begin_Term     100
End_Term       100
Govern_Type    100
foo1           100
foo2           100
dtype: int64

In [ ]:
df.Begin_Term.describe().loc['mean']

2015.07

<h2>Use .unique() for unique values<h2>

In [ ]:
df.Begin_Term.unique()

array([2014, 2013, 2019, 2016, 2017, 2020, 2007, 2015, 2018, 2011, 2010,
       2004, 2006, 1994, 2012, 2021, 2005, 2008, 2003, 2001, 2009])

In [ ]:
df['Begin_Term'].unique()

array([2014, 2013, 2019, 2016, 2017, 2020, 2007, 2015, 2018, 2011, 2010,
       2004, 2006, 1994, 2012, 2021, 2005, 2008, 2003, 2001, 2009])

In [ ]:
df.groupby(['Begin_Term'])['Order'].count()

Begin_Term
1994     1
2001     1
2003     1
2004     1
2005     1
2006     1
2007     1
2008     2
2009     1
2010     1
2011     4
2012     1
2013     9
2014    11
2015     7
2016    10
2017    16
2018    10
2019    13
2020     7
2021     1
Name: Order, dtype: int64

In [ ]:
# Look at how many records are there per state
df.groupby(['Begin_Term']).count().sort_values('foo1')

,Order,State_City,Population,Budget,Mayor,End_Term,Govern_Type,foo1,foo2
Begin_Term,,,,,,,,,
1994,1,1,1,1,1,1,1,1,1
2012,1,1,1,1,1,1,1,1,1
2010,1,1,1,1,1,1,1,1,1
2009,1,1,1,1,1,1,1,1,1
2007,1,1,1,1,1,1,1,1,1
2021,1,1,1,1,1,1,1,1,1
2005,1,1,1,1,1,1,1,1,1
2004,1,1,1,1,1,1,1,1,1
2003,1,1,1,1,1,1,1,1,1
2001,1,1,1,1,1,1,1,1,1
2006,1,1,1,1,1,1,1,1,1
2008,2,2,2,2,2,2,2,2,2
2011,4,4,4,4,4,4,4,4,4
2020,7,7,7,7,7,7,7,7,7
2015,7,7,7,7,7,7,7,7,7
2013,9,9,9,9,9,9,9,9,9
2016,10,10,10,10,10,10,10,10,10
2018,10,10,10,10,10,10,10,10,10
2014,11,11,11,11,11,11,11,11,11
2019,13,13,13,13,13,13,13,13,13
2017,16,16,16,16,16,16,16,16,16

In [ ]:
import pandas as pd 
df = pd.read_csv(r'class_heights2.txt', delimiter = '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df

     gender height Gender_abr
0      male    5'9          M
1    female    5'2          F
2    female    5'6          F
3      male   6'10          M
4      male    5'7          M
..      ...    ...        ...
155  female    5'8          F
156  female    5'9          F
157    male    6'0          M
158  female    5'7          F
159    male   5'11          M

[160 rows x 3 columns]

In [ ]:
import pandas as pd
df = pd.read_csv('class_heights2.txt',delimiter= '|')
df['height'] = df['height'].map(lambda x: x.replace("'"," "))
df[['Feet','Inches']] = df['height'].str.split(' ',expand = True)
df['Total_height'] = df['Feet'].astype('int64')*12 + df['Inches'].astype('int64')
df

     gender height Feet Inches  Total_height
0      male    5 9    5      9            69
1    female    5 2    5      2            62
2    female    5 6    5      6            66
3      male   6 10    6     10            82
4      male    5 7    5      7            67
..      ...    ...  ...    ...           ...
155  female    5 8    5      8            68
156  female    5 9    5      9            69
157    male    6 0    6      0            72
158  female    5 7    5      7            67
159    male   5 11    5     11            71

[160 rows x 5 columns]

In [ ]:
import pandas as pd 
df = pd.read_csv(r'class_heights2.txt', delimiter = '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df['Total_Height'] = df['height'].apply(lambda x: (x.replace("'",'*12 +')))
df

     gender height Gender_abr Total_Height
0      male    5'9          M      5*12 +9
1    female    5'2          F      5*12 +2
2    female    5'6          F      5*12 +6
3      male   6'10          M     6*12 +10
4      male    5'7          M      5*12 +7
..      ...    ...        ...          ...
155  female    5'8          F      5*12 +8
156  female    5'9          F      5*12 +9
157    male    6'0          M      6*12 +0
158  female    5'7          F      5*12 +7
159    male   5'11          M     5*12 +11

[160 rows x 4 columns]

In [ ]:
import pandas as pd 
df = pd.read_csv(r'class_heights2.txt', delimiter = '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df['Total_Height'] = df['height'].apply(lambda x: eval(x.replace("'",'*12 +')))
df.tail(15)

     gender height Gender_abr  Total_Height
145  female    5'4          F            64
146  female    5'5          F            65
147    male    6'5          M            77
148  female   5'11          F            71
149    male    5'8          M            68
150    male    5'9          M            69
151  female    5'6          F            66
152  female    5'6          F            66
153    male    6'4          M            76
154    male   5'10          M            70
155  female    5'8          F            68
156  female    5'9          F            69
157    male    6'0          M            72
158  female    5'7          F            67
159    male   5'11          M            71

In [ ]:
import pandas as pd
df = pd.read_csv('class_heights2.txt',delimiter= '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df['Total_Height'] = df['height'].apply(lambda x: eval(x.replace("'", '*12 +')))
# Sort by females height first then rest of height
df.sort_values(by=['Total_Height','gender'], inplace= True)
df

     gender height Gender_abr  Total_Height
12   female    5'0          F            60
36   female    5'0          F            60
52   female    5'0          F            60
92   female    5'0          F            60
116  female    5'0          F            60
..      ...    ...        ...           ...
147    male    6'5          M            77
3      male   6'10          M            82
43     male   6'10          M            82
83     male   6'10          M            82
123    male   6'10          M            82

[160 rows x 4 columns]

In [ ]:
# sort by height
import pandas as pd 
df = pd.read_csv(r'class_heights2.txt', delimiter = '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df['Total_Height'] = df['height'].apply(lambda x: eval(x.replace("'",'*12 +')))
df.sort_values(by = ['Total_Height','gender'], inplace = True, ascending = False)
df.head(25)

    gender height Gender_abr  Total_Height
3     male   6'10          M            82
43    male   6'10          M            82
83    male   6'10          M            82
123   male   6'10          M            82
67    male    6'5          M            77
147   male    6'5          M            77
17    male    6'4          M            76
73    male    6'4          M            76
97    male    6'4          M            76
153   male    6'4          M            76
13    male    6'2          M            74
93    male    6'2          M            74
7     male    6'1          M            73
23    male    6'1          M            73
47    male    6'1          M            73
57    male    6'1          M            73
87    male    6'1          M            73
103   male    6'1          M            73
127   male    6'1          M            73
137   male    6'1          M            73
27    male    6'0          M            72
33    male    6'0          M            72
37    male    6'0          M            72
53    male    6'0          M            72
77    male    6'0          M            72

In [ ]:
# Write to a file
# sort by height
import pandas as pd 
df = pd.read_csv(r'class_heights2.txt', delimiter = '|')
df
df['Gender_abr'] = df['gender'].map(lambda x: 'M' if x == 'male' else 'F')
df['Total_Height'] = df['height'].apply(lambda x: eval(x.replace("'",'*12 +')))
df.sort_values(by = ['Total_Height','gender'], inplace = True, ascending = False)
df.to_csv(r'height_by_gender.csv')
df.to_csv(r'height_by_gender_noindex.csv', index = False, sep = '\t')

<h2>eval() sidebar</h2>
You evaluate an expression

In [ ]:
x = '5 + 12'
print(eval(x))

17

In [ ]:
x = 'a**2'
a = 4
print(eval(x))

16

<h2>exec() sidebar</h2>
You execute a command

In [ ]:
import os
x = 'curr_dir = os.getcwd()'
exec(x)
print(curr_dir)

/Users/shaq/Desktop/data_sci

In [ ]:
import pandas as pd
import numpy as np
  
# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]
  
# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
  
  
# Apply function numpy.square() to square 
# the values of 3 rows only i.e. with row
# index name 'a', 'e' and 'g' only
df = df.apply(lambda x: np.square(x) if x.name in [
              'a', 'e', 'g'] else x, axis=1)
  
# printing dataframe
df

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

<h2>To filter or search for values - isin([])</h2>

In [ ]:
import pandas as pd
df = pd.DataFrame({'num_legs': [2, 4,0,8,4], 'num_wings': [2, 0,0,0,4]},

                  index=['falcon', 'dog','snake','spider','dragonfly'])
df

           num_legs  num_wings
falcon            2          2
dog               4          0
snake             0          0
spider            8          0
dragonfly         4          4

In [ ]:
df.isin([8])

           num_legs  num_wings
falcon        False      False
dog           False      False
snake         False      False
spider         True      False
dragonfly     False      False

In [ ]:
df.isin([2,4])

           num_legs  num_wings
falcon         True       True
dog            True      False
snake         False      False
spider        False      False
dragonfly      True       True

<h2>isin() filter by column</h2>

In [ ]:
filter = [2,4]
num_legs = df[df.num_legs.isin(filter)]
num_legs

           num_legs  num_wings
falcon            2          2
dog               4          0
dragonfly         4          4

In [ ]:
import pandas as pd

df = pd.read_csv(r'baseball.csv')
df[df["team"]=="NYN"]

,id,player,year,stint,team,lg,g,ab,r,h,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
9,89178,francju01,2007,1,NYN,NL,40,50,7,10,...,8.0,2.0,1.0,10,13.0,0.0,0.0,0.0,1.0,1.0
24,89352,valenjo03,2007,1,NYN,NL,51,166,18,40,...,18.0,2.0,1.0,15,28.0,4.0,0.0,1.0,1.0,5.0
41,89381,seleaa01,2007,1,NYN,NL,31,4,0,0,...,0.0,0.0,0.0,1,1.0,0.0,0.0,1.0,0.0,0.0
51,89402,parkch01,2007,1,NYN,NL,1,1,0,0,...,0.0,0.0,0.0,0,1.0,0.0,0.0,0.0,0.0,0.0
57,89421,martipe02,2007,1,NYN,NL,5,9,1,1,...,0.0,0.0,0.0,0,6.0,0.0,0.0,2.0,0.0,0.0
72,89463,greensh01,2007,1,NYN,NL,130,446,62,130,...,46.0,11.0,1.0,37,62.0,4.0,5.0,1.0,1.0,14.0
78,89469,glavito02,2007,1,NYN,NL,33,56,3,12,...,4.0,0.0,0.0,6,5.0,0.0,0.0,12.0,1.0,0.0
83,89482,easleda01,2007,1,NYN,NL,76,193,24,54,...,26.0,0.0,1.0,19,35.0,1.0,5.0,0.0,1.0,2.0
84,89489,delgaca01,2007,1,NYN,NL,139,538,71,139,...,87.0,4.0,0.0,52,118.0,8.0,11.0,0.0,6.0,12.0
86,89494,coninje01,2007,2,NYN,NL,21,41,2,8,...,5.0,0.0,0.0,7,8.0,2.0,0.0,1.0,1.0,1.0
98,89533,aloumo01,2007,1,NYN,NL,87,328,51,112,...,49.0,3.0,0.0,27,30.0,5.0,2.0,0.0,3.0,13.0
99,89534,alomasa02,2007,1,NYN,NL,8,22,1,3,...,0.0,0.0,0.0,0,3.0,0.0,0.0,0.0,0.0,0.0

In [ ]:
import pandas as pd

df = pd.read_csv(r'baseball.csv')

df = df[df["rbi"] > 20]  
df = df[df["team"]=="NYN"]
df

,id,player,year,stint,team,lg,g,ab,r,h,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
72,89463,greensh01,2007,1,NYN,NL,130,446,62,130,...,46.0,11.0,1.0,37,62.0,4.0,5.0,1.0,1.0,14.0
83,89482,easleda01,2007,1,NYN,NL,76,193,24,54,...,26.0,0.0,1.0,19,35.0,1.0,5.0,0.0,1.0,2.0
84,89489,delgaca01,2007,1,NYN,NL,139,538,71,139,...,87.0,4.0,0.0,52,118.0,8.0,11.0,0.0,6.0,12.0
98,89533,aloumo01,2007,1,NYN,NL,87,328,51,112,...,49.0,3.0,0.0,27,30.0,5.0,2.0,0.0,3.0,13.0

<h2> Exercise</h2>
Find all of the records for team = 'NYN'

In [ ]:
df[df["team"]=="NYN"]

,id,player,year,stint,team,lg,g,ab,r,h,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
72,89463,greensh01,2007,1,NYN,NL,130,446,62,130,...,46.0,11.0,1.0,37,62.0,4.0,5.0,1.0,1.0,14.0
83,89482,easleda01,2007,1,NYN,NL,76,193,24,54,...,26.0,0.0,1.0,19,35.0,1.0,5.0,0.0,1.0,2.0
84,89489,delgaca01,2007,1,NYN,NL,139,538,71,139,...,87.0,4.0,0.0,52,118.0,8.0,11.0,0.0,6.0,12.0
98,89533,aloumo01,2007,1,NYN,NL,87,328,51,112,...,49.0,3.0,0.0,27,30.0,5.0,2.0,0.0,3.0,13.0